NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2015 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */
#include <string.h>
#include <math.h>
#include "I2Cdev.h"
#include "MPU6050.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
typedef struct
{
    int16_t Accelerometer_X;
    int16_t Accelerometer_Y;
    int16_t Accelerometer_Z;
    int16_t Temperature;
    int16_t Gyroscope_X;
    int16_t Gyroscope_Y;
    int16_t Gyroscope_Z;
    uint32_t delta_time;
} MPU6050_MotionData_t;

typedef struct
{
    int mean_ax;
    int mean_ay;
    int mean_az;
    int mean_gx;
    int mean_gy;
    int mean_gz;
    int var_ax;
    int var_ay;
    int var_az;
    int var_gx;
    int var_gy;
    int var_gz;
    int16_t offset_ax;
    int16_t offset_ay;
    int16_t offset_az;
    int16_t offset_gx;
    int16_t offset_gy;
    int16_t offset_gz;
} MPU6050_CalibrationData_t;

enum UART_Commands {
    UART_COMMAND_NOT_RECEIVED = 0,
    UART_REQUEST_SEND,
    UART_REQUEST_STOP,
    UART_REQUEST_SEND_BYTE,
    UART_REQUEST_SEND_MPU6050_TEST_DATA,
    UART_REQUEST_SEND_MPU6050_DATA,
    UART_REQUEST_CALIB_DATA,

    UART_TEST_CONNECTION,			// request
    UART_CONNECTION_FAILURE,
    UART_CONENCTION_OK,

    UART_MPU6050_TEST_CONNECTION,	// request
    UART_MPU6050_CONENCTION_FAILURE,
    UART_MPU6050_CONENCTION_OK,
    UART_NULL_RESPONSE
};

static MPU6050_MotionData_t motion_data;
static MPU6050_CalibrationData_t calibration_data;
static uint8_t motion_data_buffer[sizeof(MPU6050_MotionData_t)];
const size_t max_string_lengh = 127;
static float angle_x = 0.0;
static float angle_y = 0.0;
static float angle_z = 0.0;


//Change this 3 variables if you want to fine tune the skecth to your needs.
static const int number_of_samples=200;     //Amount of readings used to average, make it higher to get more precision but sketch will be slower  (default:1000)
static const int acel_deadzone=50;     //Acelerometer error allowed, make it lower to get more precision, but sketch may not converge  (default:8)
static const int gyro_deadzone=10;     //Giro error allowed, make it lower to get more precision, but sketch may not converge  (default:1)

static int16_t ax, ay, az,gx, gy, gz;
static int state=0;


#define LED_PIN GPIO_PIN_8
#define LED_PORT GPIOC

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C2_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
extern float truncf(float x);

void init_led_hal();
void init_led();
void led_on();
void led_off();
void led_hal();
bool usart_send_str_ok(const char *input);
void usart_send_str(const char *input);
int ipow(int base, int exp);
void MPU6050_getAllData();
void MPU6050_process_data();
void usart_wait_exec_loop();
void mpu6050_loop();
void meansensors();
void calibration();
/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_I2C1_Init();
    MX_I2C2_Init();
    MX_TIM4_Init();
    MX_USART1_UART_Init();

    /* USER CODE BEGIN 2 */
    HAL_TIM_Base_Start(&htim4);

    init_led_hal();

    I2Cdev_hi2c = &hi2c1;
    MPU6050_setAddress(MPU6050_ADDRESS_AD0_LOW);
    bool connected = MPU6050_testConnection();
    while(!MPU6050_testConnection());
    MPU6050_resetSensors();
    MPU6050_initialize();
    /* USER CODE ENDint ipow(int a, int b); 2 */

