NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
}
bool usart_send_str_ok(const char *input)
{
    char string[max_string_lengh + 1];
    strncpy(string, input, sizeof(string));   // copy input without exceeding the length of the destination
    string[sizeof(string) - 1] = '\0';        // if strlen(input) = sizeof(str) then strncpy won't NUL terminate
    size_t bytes_to_sent = strlen(string) + 1; // length of input string + 1 if it is less than max_string_lengh; max_string_lengh otherwise

    // TODO: study signed/unsigned conversion below
    HAL_StatusTypeDef trans = HAL_UART_Transmit(&huart1, (uint8_t*) string, bytes_to_sent, 1000);
    if(HAL_OK == trans)
    {
        return true;
    }
    return false;
}
void usart_send_str(const char *input)
{
    usart_send_str_ok(input);
}
int ipow(int base, int exp)
{
    int result = 1;
    while (exp)
    {
        if (exp & 1)
            result *= base;
        exp >>= 1;
        base *= base;
    }

    return result;
}
void MPU6050_getAllData()
{
    // get time of arrival
    motion_data.delta_time = __HAL_TIM_GET_COUNTER(&htim4);
    // get new data
    I2Cdev_readBytes(MPU6050_ADDRESS_AD0_LOW, MPU6050_RA_ACCEL_XOUT_H, 14, motion_data_buffer, 100);
    // reset timer
    __HAL_TIM_SET_COUNTER(&htim4, 0);
    HAL_Delay(2);

    //HAL_I2C_Master_Transmit(I2Cdev_hi2c, devAddr << 1, &regAddr, 1, tout);
    //HAL_I2C_Master_Receive(I2Cdev_hi2c, devAddr << 1, motion_data_buffer, 14, tout);
    //HAL_StatusTypeDef status = HAL_I2C_Mem_Read(I2Cdev_hi2c, MPU6050_ADDRESS_AD0_LOW << 1, MPU6050_RA_ACCEL_XOUT_H, 1, motion_data_buffer, 14, 1000);


    motion_data.Accelerometer_X = (((int16_t)motion_data_buffer[0]) << 8) | motion_data_buffer[1];
    motion_data.Accelerometer_Y = (((int16_t)motion_data_buffer[2]) << 8) | motion_data_buffer[3];
    motion_data.Accelerometer_Z = (((int16_t)motion_data_buffer[4]) << 8) | motion_data_buffer[5];
    motion_data.Temperature    = (((int16_t)motion_data_buffer[6]) << 8) | motion_data_buffer[7];
    motion_data.Gyroscope_X    = (((int16_t)motion_data_buffer[8]) << 8) | motion_data_buffer[9];
    motion_data.Gyroscope_Y    = (((int16_t)motion_data_buffer[10])<< 8) | motion_data_buffer[11];
    motion_data.Gyroscope_Z    = (((int16_t)motion_data_buffer[12])<< 8) | motion_data_buffer[13];
}

void MPU6050_process_data()
{
    //x_acc = (float)(x_acc_ADC – x_acc_offset) * x_acc_scale;
        //gyro = (float)(gyro_ADC – gyro_offset) * gyro_scale;
        //angle = (0.98)*(angle + gyro * dt) + (0.02)*(x_acc);


	//filter
        angle_x = (0.98)*(angle_x + motion_data.Gyroscope_X * motion_data.delta_time) + (0.02)*(motion_data.Accelerometer_X);
        angle_y = (0.98)*(angle_x + motion_data.Gyroscope_Y * motion_data.delta_time) + (0.02)*(motion_data.Accelerometer_Y);
        angle_z = (0.98)*(angle_x + motion_data.Gyroscope_Z * motion_data.delta_time) + (0.02)*(motion_data.Accelerometer_Z);

        //integration


        	//
        	//angle calculated using accelerometer are given as
        	//\theta_x^{accel} = \tan^{-1}\frac{accel x scalled}{\sqrt{accel y scalled^2+accel z scalled^2}}
        	//\theta_y^{accel} = \tan^{-1}\frac{accel y scalled}{\sqrt{accel x scalled^2+accel z scalled^2}}

}

void usart_wait_exec_loop()
{
	HAL_StatusTypeDef status;
    while( 1 )
    {
    	//reset command
    	uint8_t command = UART_COMMAND_NOT_RECEIVED;
    	uint8_t response = UART_NULL_RESPONSE;
    	status = HAL_UART_Receive(&huart1, &command, 1, 1000);

        // if received command, dispatch it
        if(status == HAL_OK && UART_COMMAND_NOT_RECEIVED != command)
        {
			if(UART_REQUEST_SEND_MPU6050_DATA == command)
			{
				MPU6050_getAllData();
				HAL_StatusTypeDef status = HAL_UART_Transmit(&huart1, (uint8_t*)&motion_data, sizeof(motion_data), 1000);
				if(status != HAL_OK)
				{
					// TODO: process error
				}
			}
			else if(UART_REQUEST_SEND_MPU6050_TEST_DATA == command)
			{
				motion_data.Accelerometer_X = 1;
				motion_data.Accelerometer_Y = 2;
				motion_data.Accelerometer_Z = 3;
				motion_data.Temperature    = 4;
				motion_data.Gyroscope_X    = 5;
				motion_data.Gyroscope_Y    = 6;
				motion_data.Gyroscope_Z    = 7;
				status = HAL_UART_Transmit(&huart1, (uint8_t*)&motion_data, sizeof(motion_data), 1000);
			}
			else if (UART_REQUEST_CALIB_DATA == command)
			{
				meansensors();
				calibration();
				meansensors();
          
				status = HAL_UART_Transmit(&huart1, (uint8_t*)&calibration_data, sizeof(calibration_data), 1000);
			}
			else if(UART_TEST_CONNECTION == command)
			{
				response = UART_CONENCTION_OK;
				status = HAL_UART_Transmit(&huart1, &response, sizeof(response), 1000);
			}
			else if(UART_MPU6050_TEST_CONNECTION == command)
			{
				if(MPU6050_testConnection())
				{
					response = UART_MPU6050_CONENCTION_OK;
				}
				else
				{
					response = UART_MPU6050_CONENCTION_FAILURE;
				}
				status = HAL_UART_Transmit(&huart1, &response, sizeof(response), 1000);
			}

			// Process error
			if(status != HAL_OK)
			{
				// TODO: process error
			}
        }

        //reset command
        //byte = UART_COMMAND_NOT_RECEIVED
    } // end while
}

void mpu6050_loop()
{
	HAL_StatusTypeDef status;
    if (state==0)
    {
        //usart_send_str("\nReading sensors for first time...\0");
        meansensors();
        state++;
        HAL_Delay(1000);
      }

    if (state==1)
      {
        //usart_send_str("\nCalculating offsets...\0");
        calibration();
        state++;
        HAL_Delay(1000);
      }

    if (state==2)
      {
        meansensors();

        status = HAL_UART_Transmit(&huart1, (uint8_t*)&calibration_data, sizeof(calibration_data), 1000);
                    if(status != HAL_OK)
                	{
                	     // TODO: process error
                	}
        // go back
        state = 0;
      }
}

void meansensors()
{
    long i = 0, buff_ax = 0, buff_ay = 0, buff_az = 0, buff_gx = 0, buff_gy = 0, buff_gz = 0;
    int j = 0; // supplementary index

    // array of samples, each sample - array of values
    uint8_t sample_array[number_of_samples][sizeof(MPU6050_MotionData_t)];

