NikolayBobovnikov/ircapture/auvir_embed/stm32_cmake/stm32test-HAL/Src/main.c
    // collect data
    HAL_Delay(200);
    for (i = 0; i < number_of_samples; i++)
    {
        I2Cdev_readBytes(MPU6050_ADDRESS_AD0_LOW, MPU6050_RA_ACCEL_XOUT_H, 14, &(sample_array[i])[0], 100);
        HAL_Delay(2);// Wait so that not get repeated samples
    }

    // calculate mean
    for (i = 0; i < number_of_samples; i++)
    {
        ax = (((int16_t)sample_array[i][0]) << 8) | sample_array[i][1];
        ay = (((int16_t)sample_array[i][2]) << 8) | sample_array[i][3];
        az = (((int16_t)sample_array[i][4]) << 8) | sample_array[i][5];
        gx = (((int16_t)sample_array[i][8]) << 8) | sample_array[i][9];
        gy = (((int16_t)sample_array[i][10])<< 8) | sample_array[i][11];
        gz = (((int16_t)sample_array[i][12])<< 8) | sample_array[i][13];

        buff_ax = buff_ax + ax;
        buff_ay = buff_ay + ay;
        buff_az = buff_az + az;
        buff_gx = buff_gx + gx;
        buff_gy = buff_gy + gy;
        buff_gz = buff_gz + gz;

        if (i == number_of_samples - 1)
        {
            calibration_data.mean_ax = buff_ax/number_of_samples;
            calibration_data.mean_ay = buff_ay/number_of_samples;
            calibration_data.mean_az = buff_az/number_of_samples;
            calibration_data.mean_gx = buff_gx/number_of_samples;
            calibration_data.mean_gy = buff_gy/number_of_samples;
            calibration_data.mean_gz = buff_gz/number_of_samples;
        }
    }

    // calculate variance
    int squared_var_ax = 0;
    int squared_var_ay = 0;
    int squared_var_az = 0;
    int squared_var_gx = 0;
    int squared_var_gy = 0;
    int squared_var_gz = 0;

    for (i = 0; i < number_of_samples; i++)
    {
        ax = (((int16_t)motion_data_buffer[0]) << 8) | motion_data_buffer[1];
        ay = (((int16_t)motion_data_buffer[2]) << 8) | motion_data_buffer[3];
        az = (((int16_t)motion_data_buffer[4]) << 8) | motion_data_buffer[5];
        gx = (((int16_t)motion_data_buffer[8]) << 8) | motion_data_buffer[9];
        gy = (((int16_t)motion_data_buffer[10])<< 8) | motion_data_buffer[11];
        gz = (((int16_t)motion_data_buffer[12])<< 8) | motion_data_buffer[13];

        squared_var_ax = squared_var_ax + ipow((calibration_data.mean_ax - ax), 2);
        squared_var_ay = squared_var_ay + ipow((calibration_data.mean_ay - ay), 2);
        squared_var_az = squared_var_az + ipow((calibration_data.mean_az - az), 2);
        squared_var_gx = squared_var_gx + ipow((calibration_data.mean_gx - gx), 2);
        squared_var_gy = squared_var_gy + ipow((calibration_data.mean_gy - gy), 2);
        squared_var_gz = squared_var_gz + ipow((calibration_data.mean_gz - gz), 2);

        if (i == number_of_samples - 1)
        {
            calibration_data.var_ax = sqrt(squared_var_ax);
            calibration_data.var_ay = sqrt(squared_var_ay);
            calibration_data.var_az = sqrt(squared_var_az);
            calibration_data.var_gx = sqrt(squared_var_gx);
            calibration_data.var_gy = sqrt(squared_var_gy);
            calibration_data.var_gz = sqrt(squared_var_gz);
        }
    }

}

void calibration()
{
    calibration_data.offset_ax = calibration_data.mean_ax / acel_deadzone;
    calibration_data.offset_ay = calibration_data.mean_ay / acel_deadzone;
    calibration_data.offset_az = calibration_data.mean_az / acel_deadzone - 16384;//16384
    calibration_data.offset_gx = calibration_data.mean_gx / gyro_deadzone;
    calibration_data.offset_gy = calibration_data.mean_gy / gyro_deadzone;
    calibration_data.offset_gz = calibration_data.mean_gz / gyro_deadzone;

    int mean_ax_prev = 0;
    int mean_ay_prev = 0;
    int mean_az_prev = 0;
    int mean_gx_prev = 0;
    int mean_gy_prev = 0;
    int mean_gz_prev = 0;

    int iter_numer = 10;
    while (iter_numer-- != 0)
    {
        int ready = 0;
        MPU6050_setXAccelOffset(calibration_data.offset_ax);
        MPU6050_setYAccelOffset(calibration_data.offset_ay);
        MPU6050_setZAccelOffset(calibration_data.offset_az);
        MPU6050_setXGyroOffset (calibration_data.offset_gx);
        MPU6050_setYGyroOffset (calibration_data.offset_gy);
        MPU6050_setZGyroOffset (calibration_data.offset_gz);

        mean_ax_prev = calibration_data.offset_ax;
        mean_ay_prev = calibration_data.offset_ay;
        mean_az_prev = calibration_data.offset_az;
        mean_gx_prev = calibration_data.offset_gx;
        mean_gy_prev = calibration_data.offset_gy;
        mean_gz_prev = calibration_data.offset_gz;

        meansensors();

        if (abs(calibration_data.mean_ax)<= acel_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_ax < mean_ax_prev)
            {
                calibration_data.offset_ax = calibration_data.offset_ax + calibration_data.mean_ax / acel_deadzone;
            }
            else
            {
                calibration_data.offset_ax = calibration_data.offset_ax - calibration_data.mean_ax / acel_deadzone;
            }
            mean_ax_prev = calibration_data.mean_ax;
        }

        if (abs(calibration_data.mean_ay)<= acel_deadzone) ready++ ;
        else
        {
            //calibration_data.offset_ay = calibration_data.offset_ay - calibration_data.mean_ay / acel_deadzone;
            if (calibration_data.mean_ay < mean_ay_prev)
            {
                calibration_data.offset_ay = calibration_data.offset_ay + calibration_data.mean_ay / acel_deadzone;
            }
            else
            {
                calibration_data.offset_ay = calibration_data.offset_ay - calibration_data.mean_ay / acel_deadzone;
            }
            mean_ay_prev = calibration_data.mean_ay;
        }


        if (abs(16384 - calibration_data.mean_az)<= acel_deadzone) ready++ ;
        else
        {
            //calibration_data.offset_az = calibration_data.offset_az + (16384 - calibration_data.mean_az) / acel_deadzone;
            if (calibration_data.mean_az < mean_az_prev)
            {
                calibration_data.offset_az = calibration_data.offset_az + (calibration_data.mean_az - 16384) / acel_deadzone;
            }
            else
            {
                calibration_data.offset_az = calibration_data.offset_az - (calibration_data.mean_az - 16384) / acel_deadzone;
            }
            mean_az_prev = calibration_data.mean_az;
        }

        if (abs(calibration_data.mean_gx)<= gyro_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_gx < mean_gx_prev)
            {
                calibration_data.offset_gx = calibration_data.offset_gx + calibration_data.mean_gx / gyro_deadzone;
            }
            else
            {
                calibration_data.offset_gx = calibration_data.offset_gx - calibration_data.mean_gx / gyro_deadzone;
            }
            mean_gx_prev = calibration_data.mean_gx;
        }

        if (abs(calibration_data.mean_gy)<= gyro_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_gy < mean_gy_prev)
            {
                calibration_data.offset_gy = calibration_data.offset_gy + calibration_data.mean_gy / gyro_deadzone;
            }
            else
            {
                calibration_data.offset_gy = calibration_data.offset_gy - calibration_data.mean_gy / gyro_deadzone;
            }
            mean_gy_prev = calibration_data.mean_gy;
        }

        if (abs(calibration_data.mean_gz)<= gyro_deadzone) ready++ ;
        else
        {
            if (calibration_data.mean_gz < mean_gz_prev)
            {
                calibration_data.offset_gz = calibration_data.offset_gz + calibration_data.mean_gz / gyro_deadzone;
            }
            else
            {
                calibration_data.offset_gz = calibration_data.offset_gz - calibration_data.mean_gz / gyro_deadzone;
            }
            mean_gz_prev = calibration_data.mean_gz;
        }

        if (ready == 6) break;

        if(true == iter_numer)
        {
        	int about_to_exceed_tries = 0;
        }
    }
}

/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
    /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
    /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
